Revit 2024 API
BuiltInFailures.StairRampFailures Class
 Failures about StairRamp.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class StairRampFailures
Visual Basic
Public NotInheritable Class StairRampFailures
Visual C++
public ref class StairRampFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.StairRampFailures
See Also
BuiltInFailures.StairRampFailures Members
Autodesk.Revit.DB Namespace